; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v13)
             (pred_5 ?v3 ?v7)
             (pred_2 ?v2 ?v7)
             (pred_4 ?v11 ?v2 )
	     (pred_7 ?v2)
             (pred_8 ?v10)
             (pred_6 ?v3)
             (pred_12 ?v7)
             (pred_9 ?v2)
             (pred_3 ?v3)
             (pred_10 ?v2)
             (pred_1 ))



(:action op_5
:parameters (?v12 ?v4 ?v6 ?v8)
:precondition (and (pred_8 ?v12) (pred_8 ?v4) (pred_6 ?v6) (pred_12 ?v8)
          (pred_11 ?v12 ?v4) (pred_5 ?v6 ?v8)
                   (pred_2 ?v4 ?v8) (pred_7 ?v12) 
                   (pred_9 ?v4) (pred_3 ?v6))
:effect (and  (pred_10 ?v4) (not (pred_9 ?v4))))


(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_8 ?v12) (pred_8 ?v9)
               (pred_7 ?v12) (pred_11 ?v12 ?v9) (pred_10 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v12))))

(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_8 ?v12) (pred_6 ?v6) 
                  (pred_7 ?v12) (pred_4 ?v6 ?v12) (pred_1 ))
:effect (and (pred_3 ?v6)
   (not (pred_4 ?v6 ?v12)) (not (pred_1 ))))


(:action op_3
:parameters (?v12 ?v1 ?v5)
:precondition (and (pred_8 ?v12) (pred_6 ?v1) (pred_6 ?v5)
                  (pred_7 ?v12) (pred_3 ?v5) (pred_4 ?v1 ?v12))
:effect (and (pred_3 ?v1) (pred_4 ?v5 ?v12)
        (not (pred_3 ?v5)) (not (pred_4 ?v1 ?v12))))

(:action op_2
:parameters (?v12 ?v6)
:precondition (and (pred_8 ?v12) (pred_6 ?v6) 
                  (pred_7 ?v12) (pred_3 ?v6))
:effect (and (pred_1 ) (pred_4 ?v6 ?v12) (not (pred_3 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_25 obj_14 obj_08 obj_27 obj_31 obj_10 obj_21 obj_15 obj_23 obj_11 obj_09 obj_22 obj_07 obj_30 obj_12 obj_06 obj_01 obj_17 obj_16 obj_29 obj_13 obj_02 obj_24 obj_19
    obj_04 obj_03 obj_20
    obj_28 obj_18 obj_05
    )

    (:init
       (pred_1)

       (pred_8 obj_26)
       (pred_8 obj_25)
       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_27)
       (pred_8 obj_31)
       (pred_8 obj_10)
       (pred_8 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_23)
       (pred_8 obj_11)
       (pred_8 obj_09)
       (pred_8 obj_22)
       (pred_8 obj_07)
       (pred_8 obj_30)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_29)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_8 obj_24)
       (pred_8 obj_19)
       (pred_12 obj_04)
       (pred_12 obj_03)
       (pred_12 obj_20)
       (pred_6 obj_28)
       (pred_6 obj_18)
       (pred_6 obj_05)

       (pred_11 obj_26 obj_31)
       (pred_11 obj_26 obj_25)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_27)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_27 obj_23)
       (pred_11 obj_27 obj_08)
       (pred_11 obj_31 obj_11)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_31 obj_26)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_23 obj_30)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_11 obj_31)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_09 obj_22)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_22 obj_01)
       (pred_11 obj_22 obj_07)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_09)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_30)
       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_22)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_30 obj_23)
       (pred_11 obj_30 obj_07)
       (pred_11 obj_12 obj_29)
       (pred_11 obj_12 obj_06)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_12)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_01 obj_22)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_29 obj_12)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_02 obj_24)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_24 obj_19)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_24 obj_02)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_19 obj_24)
       (pred_9 obj_22)
       (pred_9 obj_25)
       (pred_9 obj_21)
       (pred_2  obj_22 obj_04)
       (pred_2  obj_25 obj_03)
       (pred_2  obj_21 obj_20)
       (pred_10 obj_26)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_10 obj_27)
       (pred_10 obj_31)
       (pred_10 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_23)
       (pred_10 obj_11)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_30)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_29)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_24)
       (pred_10 obj_19)

       (pred_5  obj_28 obj_04)
       (pred_5  obj_18 obj_03)
       (pred_5  obj_05 obj_20)
       (pred_4 obj_28 obj_06)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_05 obj_06)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_4 obj_05 obj_15)
    ))
(:constraints
  (always (not (pred_7 obj_17)))
)
)

; plan
1. (op_1 obj_13 obj_06)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_05)
   deleted: (pred_4 obj_05 obj_06) (pred_1)
   added: (pred_3 obj_05)
   goals met: 0 of 1
3. (op_1 obj_06 obj_09)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_09)
   goals met: 0 of 1
4. (op_1 obj_09 obj_10)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_10)
   goals met: 0 of 1
5. (op_5 obj_10 obj_21 obj_05 obj_20)
   deleted: (pred_9 obj_21)
   added: (pred_10 obj_21)
   goals met: 0 of 1
6. (op_1 obj_10 obj_21)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_21)
   goals met: 0 of 1
7. (op_1 obj_21 obj_15)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_15)
   goals met: 0 of 1
8. (op_2 obj_15 obj_05)
   deleted: (pred_3 obj_05)
   added: (pred_1) (pred_4 obj_05 obj_15)
   goals met: 1 of 1
